Autodesk.Revit.DB.DirectContext3D.VertexPosition.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPosition.#ctor(Autodesk.Revit.DB.XYZ)
Constructs the vertex from a point.
position:
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017